app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `routes`
SELECT COUNT(*) AS `numrows` FROM `vehicles`
---
    public function index()
    {
        // Session check (login protection)
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $routeModel   = new RouteModel();
        $vehicleModel = new VehicleModel();

        $data['routeCount']   = $routeModel->countAll();
        $data['vehicleCount'] = $vehicleModel->countAll();