app/Controllers/Payment.php

    public function verifyPayment()
    {
        $razorpay_order_id   = $this->request->getPost('razorpay_order_id');
        $razorpay_payment_id = $this->request->getPost('razorpay_payment_id');
        $razorpay_signature  = $this->request->getPost('razorpay_signature');

        $keySecret = "iKdT12MFb3QSxmLObCm8sXxO"; // YOUR KEY SECRET
        $amount    = 500; // should come from server/cart in real project

        // Generate signature
        $generated_signature = hash_hmac(
            'sha256',
            $razorpay_order_id . "|" . $razorpay_payment_id,
            $keySecret
        );

        $paymentModel = new PaymentModel();

        if ($generated_signature === $razorpay_signature) {

            // SUCCESS
            $paymentModel->insert([
                'order_id'   => $razorpay_order_id,
                'payment_id'=> $razorpay_payment_id,
                'signature' => $razorpay_signature,
                'amount'    => $amount,
                'status'    => 'SUCCESS'
            ]);
---
INSERT INTO `payments` (`order_id`, `payment_id`, `signature`, `amount`, `status`) VALUES ('order_S5dXzt85hfwyAG', 'pay_S5dY6d2Nr9XL5i', '288d3fc683219193b30c43cc56984e6462d99eeaaee49943033169b8e1239e77', 500, 'SUCCESS')

        } else {

            // FAILED
            $paymentModel->insert([
                'order_id'   => $razorpay_order_id,
                'payment_id'=> $razorpay_payment_id,
                'signature' => $razorpay_signature,
                'amount'    => $amount,
                'status'    => 'FAILED'
            ]);
---
INSERT INTO `payments` (`order_id`, `payment_id`, `signature`, `amount`, `status`) VALUES ('order_S5d4nmJKscwQes', 'pay_S5d51G1hV67lVA', 'e435f38e00994b497ed436e15f154d49ab94fa4f9ddf7d4a8f3abb795a7b2d79', 500, 'FAILED')