app/Controllers/RouteController.php

  public function list()
{
    $model = new RouteModel();

    $page  = $this->request->getGet('page') ?? 1;
    $limit = 5;
    $offset = ($page - 1) * $limit;

    $data = $model->orderBy('id','DESC')
                  ->findAll($limit, $offset);

    $total = $model->countAll();
---
SELECT *
FROM `routes`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows` FROM `routes`